Revit 2026 API

# RevitLinkInstanceGetLinkDocument Method

---

The document associated with the Revit link.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Document GetLinkDocument()
```
```vb
Public Function GetLinkDocument As Document
```
```cpp
public:
Document^ GetLinkDocument()
```
```fsharp
member GetLinkDocument : unit -> Document
```

#### Return Value

Document

Operations that require a transaction or modify the document's status in memory (such as Save and Close) cannot be performed on this document.

#### Reference

RevitLinkInstance Class

Autodesk.Revit.DB Namespace